fonecmid-diplom/src/DataProcessors/МассовоеСозданиеАктов/МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскаяПлата</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/DataProcessors/МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализации(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан период. Укажите месяц, за который создаются реализации.'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.Договоры.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Список договоров пуст. Нажмите ""Заполнить"".'"));
		Возврат;
	КонецЕсли;
	
	МассивДоговоров = Новый Массив;
	Для Каждого СтрокаДоговора Из Объект.Договоры Цикл
		МассивДоговоров.Добавить(СтрокаДоговора.Договор);
	КонецЦикла;
	
	ДлительнаяОперация = НачатьСозданиеРеализацийНаСервере(Объект.Период, МассивДоговоров, УникальныйИдентификатор);
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ТекстСообщения = НСтр("ru = 'Создание реализаций по абонентским договорам...'");
	
	Обработчик = Новый ОписаниеОповещения("СоздатьРеализацииЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьРеализацииЗавершение(Операция, ДополнительныеПараметры) Экспорт
	
	Если Операция = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Операция.Статус = "Отменено" Тогда
		Возврат;
	КонецЕсли;
	
	Если Операция.Статус <> "Выполнено" Тогда
		ПоказатьПредупреждение(, Операция.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
	ОбновитьРезультатыНаСервере(Операция.АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Договоры.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Договор";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Договоры.Добавить();
		НоваяСтрока.Договор = Выборка.Договор;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НачатьСозданиеРеализацийНаСервере(Период, МассивДоговоров, КлючДлительнойОперации)
	
	Параметры = Новый Структура("Период, Договоры", Период, МассивДоговоров);
	
	ИмяМетода = "Обработки.МассовоеСозданиеАктов.СоздатьРеализации";
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(КлючДлительнойОперации);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Массовое создание актов'");
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, Параметры, НастройкиЗапуска);
	
КонецФункции

&НаСервере
Процедура ОбновитьРезультатыНаСервере(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Объект.Договоры.Очистить();
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		НоваяСтрока = Объект.Договоры.Добавить();
		НоваяСтрока.Договор = СтрокаРезультата.Договор;
		НоваяСтрока.Реализация = СтрокаРезультата.Реализация;
		НоваяСтрока.Комментарий = СтрокаРезультата.Комментарий;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
